In [1]:
# Pandas is a package that is used for data analysis and data manipulation. 
# It’s used in a variety of packages and therefore understanding of it and its concepts is a crucial tool 
# for a Python programmer to learn. 
# In this chapter, we will introduce the pandas package from the basics up to some more advanced techniques. 
# However, before we get started with pandas, we will briefly cover numpy arrays which alongside dictionaries 
# and lists are concepts that should be understood to allow us to cover pandas.

In [2]:
# Numpy Arrays

# Numpy comes as part of the Anaconda distribution and is a key component in the scientific libraries within Python. 
# It is very fast and underpins many other packages within Python.
# We concentrate on one specific aspect of it, numpy arrays. 
# However, if you are interested in any of the machine learning libraries within Python, then numpy is certainly something
# worth exploring further.
# We can import it as follows: 

import numpy as np

In [3]:
# Why np? Its the standard convention used in the documentation.
# However you do not have to use that convention but we will. 
# In this chapter, we won’t cover everything to do with numpy but instead only introduce a few concepts 
# and the first one we will do is introduce an array. 
# An array in numpy is much like a list in Python. 
# If we want to create an array of integers 0–10 we can do so as follows:

number_array = np.array([1,2,3,4,5,6,7,8,9,10])
number_array

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [4]:
# It looks like we passed a list into the method array and that is basically what we did as we can define the same array.

number_list = [1,2,3,4,5,6,7,8,9,10]
number_array = np.array(number_list)
number_array

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [5]:
# You may be thinking it looks like a list and we can use a list to create it, why is it different from a list. 
# Very early on we looked at lists and operations on lists and we saw that using the common mathematical operators 
# either didn’t work or worked in an unexpected way.
# We will now cover these again and compare them to what happens when using an array in numpy. 
# We will begin by looking at addition:

number_list + number_list

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [6]:
number_array + number_array

array([ 2,  4,  6,  8, 10, 12, 14, 16, 18, 20])

In [7]:
# So, what we see is that with a list we have concatenation of two lists which is what we have seen before.
# However using an array we add together the two arrays and return a single array where the result is the 
# element wise addition. 
# Next, let’s consider what happens when we use the mathematical subtraction symbol.

number_list - number_list

TypeError: unsupported operand type(s) for -: 'list' and 'list'

In [8]:
number_list * number_list

TypeError: can't multiply sequence by non-int of type 'list'

In [9]:
number_array * number_array

array([  1,   4,   9,  16,  25,  36,  49,  64,  81, 100])

In [10]:
# Again, we see that this operand doesn’t work on two lists but the arrays provide elementwise multiplication. 
# Now for completion we will look at the division operand on both lists and arrays.

number_list / number_list

TypeError: unsupported operand type(s) for /: 'list' and 'list'

In [11]:
number_array / number_array

array([1., 1., 1., 1., 1., 1., 1., 1., 1., 1.])

In [12]:
# Unsurprisingly, we see that this doesn’t work on lists but on the arrays it performs elementwise division of the values 
# in the first array by those in the second. 
# This is great if we want to perform some mathematical operation on two lists which we cannot do and can be much faster. 
# For the examples we have covered so far we can achieve the same thing using lists in Python in one line via 
# list comprehension. 
# So the three examples that didn’t work here can be rewritten in as follows:

number_list

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [13]:
subtraction_list = [n - n for n in number_list]
subtraction_list

[0, 0, 0, 0, 0, 0, 0, 0, 0, 0]

In [14]:
multiplication_list = [n * n for n in number_list]
multiplication_list

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [15]:
division_list = [n / n for n in number_list]
division_list

[1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0]

In [16]:
# Now, it should be noted that we have simply worked with operations on the same list which makes it easy to rewrite.
# However if we had two distinct lists we cannot use list comprehension and to rewrite using loops becomes more difficult. 
# Let’s demonstrate this by creating two random integer arrays.
# So in numpy, we can do this by using the random choice functionality as follows:

np.random.choice(10,10)

# Here, we generated an array of length 10 containing random numbers between 0 and 9.

array([1, 0, 9, 9, 3, 2, 5, 5, 9, 0])

In [17]:
# Now if we extend this example to 1 million random numbers and generate two arrays we can multiply them together as follows:

x = np.random.choice(100,1000000)
x

array([70, 79,  9, ...,  2, 43, 37])

In [18]:
y = np.random.choice(100,1000000)
y

array([95, 18, 80, ..., 39, 59, 54])

In [19]:
result = x*y
result

array([6650, 1422,  720, ...,   78, 2537, 1998])

In [20]:
# What we have just done is complete 1 million multiplications instantly.
# If you try this using loops you would be waiting quite a bit longer than an instance! 
# We have seen how powerful numpy arrays are but how do we access elements of them. 
# Luckily we can access elements as we did for lists. 
# We will give some examples below applied to the result array from the previous example:

result[10]

3572

In [21]:
result[10:20]

array([3572, 3520, 3731, 4042, 1332,  672,  792,  120,  415, 4624])

In [22]:
result[0]

6650

In [23]:
result[-3:-1]

array([  78, 2537])

In [24]:
# You can see that we access elements in much the same we did for lists.
# Now having introduced the concept of an array alongside everything else 
# means we can start looking at Pandas starting with Series.

# Series

# We can import pandas as follows:

import pandas as pd

In [25]:
# Like before with numpy we use the alias pd which is the general convention used in the documentation for the package.
# The first thing that we will cover here is the concept of a Series, we shall demonstrate this first by an example:

point_dict = {"Bulgaria":45, "Romania":43, "Hungary":30, "Denmark":42}
point_dict

{'Bulgaria': 45, 'Romania': 43, 'Hungary': 30, 'Denmark': 42}

In [26]:
point_series = pd.Series(point_dict)
point_series

Bulgaria    45
Romania     43
Hungary     30
Denmark     42
dtype: int64

In [27]:
# We created a dictionary containing the keys of country names and the median age of citizens (source worldomometers.info) 
# in that country and passes then in to the Series method to create point series. 
# We can access the elements of the series as follows:

point_series[0]

45

In [28]:
point_series[1:3]

Romania    43
Hungary    30
dtype: int64

In [29]:
point_series[-1]

42

In [30]:
point_series[:-1]

Bulgaria    45
Romania     43
Hungary     30
dtype: int64

In [31]:
point_series[[1,3]]

# point_series[1,3] will generate error.

Romania    43
Denmark    42
dtype: int64

In [32]:
# You can see we can access the first element as if it was a list using the position of the value we want. 
# We can also use the colon separated positional values as well as negative indices which we have covered earlier. 
# There is a different way we can access elements of the series and that is by passing a list of the positions we 
# want from the series. 
# So if we want the first and third elements we have the values 0 and 2 in the list.
# We have just accessed the values of the dict that we passed in to create the series but what about the keys and 
# what use do they have in the series? 
# What we will now show is that the series can also be accessed like it was a dictionary:

point_series.index

Index(['Bulgaria', 'Romania', 'Hungary', 'Denmark'], dtype='object')

In [33]:
point_series["Bulgaria"]

45

In [34]:
# We see the series has an index which is the key of the dictionary and we can access the values using the 
# dictionary access approach we have seen earlier. 
# Now, when we covered dictionaries earlier we saw that we could try and access a value from a key that isn’t 
# in the dictionary and it would throw an exception which is the same for the series.

point_series["England"]

KeyError: 'England'

In [35]:
# Here, we have shown what happens but you can see we have used the method 'get' to try and access the value 
# for the index England. 
# As opposed to throwing an exception it just returns None.

point_series.get("England")

In [36]:
# Given we can now access elements of a series we will now show how you can operate on it. 
# Given the series is based on the concept of an array in numpy you can do much of what you would in numpy to the series. 
# So, now we will create series of random numbers and show how we can operate on them.

np.random.rand(10)

array([0.30164893, 0.74762524, 0.05110895, 0.66485453, 0.04611571,
       0.56399935, 0.50765346, 0.34130077, 0.63494244, 0.6930268 ])

In [37]:
# Here, we have used numpy’s random methods to generate an array of 10 random numbers between 0 and 1. 
# This can be assigned to a series relatively easily.

random_series = pd.Series(np.random.rand(10))
random_series

0    0.024283
1    0.002974
2    0.953903
3    0.093404
4    0.065081
5    0.737517
6    0.318643
7    0.903758
8    0.548846
9    0.646275
dtype: float64

In [38]:
# We can operate on this in much the same way as we do with a numpy array.

random_series_one = pd.Series(np.random.rand(10))
random_series_one

0    0.323351
1    0.250841
2    0.923685
3    0.851655
4    0.249438
5    0.683955
6    0.839537
7    0.464056
8    0.027956
9    0.482942
dtype: float64

In [39]:
random_series_two = pd.Series(np.random.rand(10))
random_series_two

0    0.390174
1    0.121738
2    0.577209
3    0.937609
4    0.181125
5    0.492296
6    0.018474
7    0.062161
8    0.654138
9    0.275578
dtype: float64

In [40]:
random_series_one + random_series_two

0    0.713526
1    0.372579
2    1.500894
3    1.789265
4    0.430563
5    1.176251
6    0.858011
7    0.526217
8    0.682094
9    0.758520
dtype: float64

In [41]:
random_series_one / random_series_two

0     0.828736
1     2.060503
2     1.600261
3     0.908327
4     1.377158
5     1.389316
6    45.444717
7     7.465371
8     0.042737
9     1.752468
dtype: float64

In [42]:
# Now that all looks the same as we have seen for arrays earlier.
# However one key difference is that we can operate on splices of the series.

random_series_one[3:] * random_series_two[:-1]

# What we see is that the multiplication is done on the elements of the series by index.
# So where we don’t have an index for both series we get an NaN shown.

0         NaN
1         NaN
2         NaN
3    0.798520
4    0.045179
5    0.336709
6    0.015509
7    0.028846
8    0.018287
9         NaN
dtype: float64

In [43]:
# We earlier defined a series by using a dictionary but we can define a series using a list or array as follows:

pd.Series([1,2,3,4,5,6])

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [44]:
pd.Series(np.array([1,2,3,4,5,6]))

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int32

In [45]:
# As you can see the index is defined automatically by pandas.
# However if we want a specific index we can define one as follows:

pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [46]:
pd.Series([1,2,3,4,5], index=[5,4,3,2,1])

5    1
4    2
3    3
2    4
1    5
dtype: int64

In [47]:
# So, here we pass an optional list to the index variable and this gets defined as the index for the series. 
# It must be noted that the length of the index list must match that of the list or array that we want to make a series.

In [48]:
# DataFrames

# Having looked at series, we will now turn our attention to data frames which are arguably the most popular aspect 
# of pandas and are certainly what we use the most. 
# They are essentially an object that carries data in column and row format, so for many they will mimic what is held 
# in a spreadsheet or for others the content of a database table.
# We will start off by looking at how we create a DataFrame and like with a series there are many ways we can do it.

countries = ["United Kingdom","France","Germany","Spain","Italy"]
median_age = [40,42,46,45,47]
country_dict = {"name":countries, "median age":median_age}
country_df = pd.DataFrame(country_dict)

In [49]:
country_dict

{'name': ['United Kingdom', 'France', 'Germany', 'Spain', 'Italy'],
 'median age': [40, 42, 46, 45, 47]}

In [50]:
country_df

             name  median age
0  United Kingdom          40
1          France          42
2         Germany          46
3           Spain          45
4           Italy          47

In [51]:
# What we have done above is begin by setting up two lists, one containing names and another containing values. 
# These are then put into a dictionary with keys name and value.
# This dictionary is then passed into the 'DataFrame' method of pandas and what we get back is a DataFrame object 
# with column names of name and values. 
# We can see here that the index is automatically defined as 0–4 to correspond with the number of elements in each list.

countries = pd.Series(["United Kingdom","France","Germany","Spain","Italy"])
median_age = pd.Series([40,42,46,45,47])

country_dict = {"name":countries, "median age":median_age}
country_df = pd.DataFrame(country_dict)
country_df

# We can do the same using a dictionary of Series again assigning the Series to a dictionary and passing it into 
# the DataFrame method. 
# The same would happen if we used numpy arrays.

             name  median age
0  United Kingdom          40
1          France          42
2         Germany          46
3           Spain          45
4           Italy          47

In [52]:
# Next, we create a DataFrame using a list of tuples where the data is now country name, median age and density of the country.

data = [("United Kingdom",40,281),("France",42,119),("Italy",46,206)]
data

[('United Kingdom', 40, 281), ('France', 42, 119), ('Italy', 46, 206)]

In [53]:
data_df = pd.DataFrame(data)
data_df

                0   1    2
0  United Kingdom  40  281
1          France  42  119
2           Italy  46  206

In [54]:
# Here, we have created a list of tuples and we then pass those into the 'DataFrame' method and it returns a three column 
# by three row data frame. 
# Unlike before we not only have auto assigned index values but we also have auto assigned column names which aren’t the 
# most useful.
# However we will later show how to assign both. 
# The same applies here for a list of lists, list of series, or a list or arrays. 
# It also works for a list of dictionaries, however the behaviour is slightly different.

data = [{"country":"United Kingdom", "median age":40, "density":281}, 
        {"country":"France", "median age":42, "density":119}, 
        {"country":"Italy", "median age":46, "density":206}]
data

[{'country': 'United Kingdom', 'median age': 40, 'density': 281},
 {'country': 'France', 'median age': 42, 'density': 119},
 {'country': 'Italy', 'median age': 46, 'density': 206}]

In [55]:
data_df = pd.DataFrame(data)
data_df

          country  median age  density
0  United Kingdom          40      281
1          France          42      119
2           Italy          46      206

In [56]:
# When the list of dictionaries is passed in we get the same DataFrame.
# However now we have column names from the dictionary. 
# On the face of it everything seems like it works the same as for lists of lists. 
# However if we change some of the keys we get some different behaviour.

data = [{"country":"United Kingdom", "median age":40, "density":281},
       {"country":"France", "median age":42, "density":119},
       {"country":"Italy", "median":46, "density":206}]
data

[{'country': 'United Kingdom', 'median age': 40, 'density': 281},
 {'country': 'France', 'median age': 42, 'density': 119},
 {'country': 'Italy', 'median': 46, 'density': 206}]

In [57]:
data_df = pd.DataFrame(data)
data_df

          country  median age  density  median
0  United Kingdom        40.0      281     NaN
1          France        42.0      119     NaN
2           Italy         NaN      206    46.0

In [58]:
# What we see here is that as every dictionary doesn’t have all the same keys pandas fills in the missing values with NaN. 
# Next, we will look at how to access elements of the dataframe.

data = [{"country":"United Kingdom", "median age":40, "density":281},
       {"country":"France", "median age":42, "density":119},
       {"country":"Italy", "median age":46, "density":206}]
data_df = pd.DataFrame(data)
data_df

          country  median age  density
0  United Kingdom          40      281
1          France          42      119
2           Italy          46      206

In [59]:
data_df["country"]

0    United Kingdom
1            France
2             Italy
Name: country, dtype: object

In [60]:
data_df["country"][0]

'United Kingdom'

In [61]:
data_df["country"][0:2]

0    United Kingdom
1            France
Name: country, dtype: object

In [62]:
# The first thing is that we have defined the data frame based on the list of dictionaries as we showed previously. 
# We then accessed all the elements of the column country by passing the name of the column as the key of the data frame. 
# We next showed how we could access the first element of that by adding the index of the value we wanted. 
# This is an important distinction as we aren’t asking for the first element, we are instead asking for the value of the 
# column with index value 0. 
# Lastly, we select the rows of the country with index 0 and 1 in the usual way we would for a list, but again we are asking
# for specific index rows.

In [63]:
data_df["country"][-1]

KeyError: -1

In [64]:
# Here, we asked for the last value of the column country as we would with a list.
# However it threw an error because there is no index −1 in the index for the data frame. 
# So we can’t treat the data frame as we would a list and we need to have an understanding of the index.
# For any dataframe we can find out the index and columns as follows:

data_df.index

RangeIndex(start=0, stop=3, step=1)

In [65]:
data_df.columns

Index(['country', 'median age', 'density'], dtype='object')

In [66]:
# Here, it shows the index starting at 0 and stopping at 3 with the step used each time. 
# It also shows the columns as a list of each name. 
# We can change the index of a data frame as follows:

data_df.index = ['a','b','c']
data_df

          country  median age  density
a  United Kingdom          40      281
b          France          42      119
c           Italy          46      206

In [67]:
# Now if we want to access the first element of the country column we do so as follows:

data_df["country"]['a']

'United Kingdom'

In [68]:
# Similarly if we want to change the column names of a data frame we do so as follows:

data_df.columns = ["country_name", "median_age", "density"]
data_df

     country_name  median_age  density
a  United Kingdom          40      281
b          France          42      119
c           Italy          46      206

In [69]:
# Given we have changed the index to strings, the question is how do we access the nth row if we don’t know what the index is. 
# Luckily there is a method of data frames called iloc which allow us to access the nth row by just passing in the number of 
# the row that we want. It works as follows:

data_df.iloc[0]

country_name    United Kingdom
median_age                  40
density                    281
Name: a, dtype: object

In [70]:
data_df.iloc[0:1]

     country_name  median_age  density
a  United Kingdom          40      281

In [71]:
data_df.iloc[0:2]

     country_name  median_age  density
a  United Kingdom          40      281
b          France          42      119

In [72]:
data_df.iloc[-1]

country_name    Italy
median_age         46
density           206
Name: c, dtype: object

In [73]:
# We can see we can access rows from the data frame as if it was a list, which is cool.
# Let’s say we want to add a column of all ones to our DataFrames we can do so as follows:

data_df["ones"] = 1
data_df

     country_name  median_age  density  ones
a  United Kingdom          40      281     1
b          France          42      119     1
c           Italy          46      206     1

In [74]:
# We can then delete a column in a couple of ways:

del data_df["ones"]

In [75]:
data_df

     country_name  median_age  density
a  United Kingdom          40      281
b          France          42      119
c           Italy          46      206

In [76]:
data_df["ones"] = 1
data_df.pop("ones")

a    1
b    1
c    1
Name: ones, dtype: int64

In [77]:
data_df

     country_name  median_age  density
a  United Kingdom          40      281
b          France          42      119
c           Italy          46      206

In [78]:
# Here, we first used the 'del' method to delete the ones column, we then added it again and then used the 'pop' method 
# to remove the column. 
# Note that when we use the 'del' method, we simply delete from the DataFrame but using the 'pop' method we return the column we
# have popped as well as removing it from the DataFrame.

In [79]:
data_df["ones"] = 1
data_df

     country_name  median_age  density  ones
a  United Kingdom          40      281     1
b          France          42      119     1
c           Italy          46      206     1

In [80]:
data_df["new_ones"] = data_df["ones"][1:2]
data_df

     country_name  median_age  density  ones  new_ones
a  United Kingdom          40      281     1       NaN
b          France          42      119     1       1.0
c           Italy          46      206     1       NaN

In [81]:
del data_df["new_ones"]
del data_df["ones"]

# What we see here is that when we use a partial column to form a new one, pandas knows to fill in the gaps with the NaN value. 
# There is another approach where we can insert a column and put it in a specific position:

In [82]:
data_df.insert(1,"twos",2)
data_df

# Here, we create a column containing the integer value 2 and puts it into position 1 
# (remember position 0 is the first position) under the title twos. 
# This gives us full control of how we add to the dataframe.

     country_name  twos  median_age  density
a  United Kingdom     2          40      281
b          France     2          42      119
c           Italy     2          46      206

In [83]:
del data_df["twos"]
data_df

     country_name  median_age  density
a  United Kingdom          40      281
b          France          42      119
c           Italy          46      206

In [84]:
# So, now we have a grasp of what a DataFrame is we can start doing some cool things to it. 
# Let’s say we want to take all data where the value is less than 20.

data_df["density"] < 200

a    False
b     True
c    False
Name: density, dtype: bool

In [85]:
data_df[data_df["density"] < 200]

  country_name  median_age  density
b       France          42      119

In [86]:
# What we have done here is test the values in data_df values column to see which ones are less than 20. 
# This concept is a pretty key, we test every element in the column to see which ones are less than 20 and return 
# a boolean column to show which ones meet the criteria.
# We can then pass this into the square brackets around a DataFrame and it returns the values where the condition is true. 
# We can do this on multiple boolean statements where anything true across all the statements is returned, this is shown below:

data_df[data_df["density"] < 250]

  country_name  median_age  density
b       France          42      119
c        Italy          46      206

In [87]:
data_df["median_age"] > 42

a    False
b    False
c     True
Name: median_age, dtype: bool

In [88]:
data_df[(data_df["density"] < 250) & (data_df["median_age"] > 42)]

  country_name  median_age  density
c        Italy          46      206

In [89]:
# It is important to note that the DataFrame isn’t changed in this instance it stays the same.
# To use the DataFrame that is returned from such an operation you need to assign it to a variable to use later.

(data_df["density"] < 250) & (data_df["median_age"] > 42)

a    False
b    False
c     True
dtype: bool

In [90]:
data_df["test"] = (data_df["density"] < 250) & (data_df["median_age"] > 42)

In [91]:
data_df

     country_name  median_age  density   test
a  United Kingdom          40      281  False
b          France          42      119  False
c           Italy          46      206   True

In [92]:
del data_df["test"]

# Here, we have used the same test as used in the previous example and assigned it to a column which is 
# now part of the DataFrame. 
# We could do the same thing if we wanted to create another column that uses the data in dataframe.

In [93]:
data_df["density"].sum()

606

In [94]:
data_df["density_proportion"] = data_df["density"] / data_df["density"].sum()

In [95]:
data_df

     country_name  median_age  density  density_proportion
a  United Kingdom          40      281            0.463696
b          France          42      119            0.196370
c           Italy          46      206            0.339934

In [96]:
# Here, we have divided all values in the value column with the sum of all the values in the column 
# which we can see is 606 to give us a new column of data. 
# We can also perform standard mathematical operations to a column. 
# Below we use the numpy exponential function to exponentiate every element of the column:

np.exp(data_df["density"])

a    1.088302e+122
b     4.797813e+51
c     2.915166e+89
Name: density, dtype: float64

In [97]:
# We can also loop across a dataframe as we have seen before with lists.

for n in data_df:
    print(n)

country_name
median_age
density
density_proportion

In [98]:
# This isn’t exactly what we thought we would get as it only loops across the column names.
# We really want to get into the meat of the dataframe to that we have to introduce the concept of transpose.

data_df

     country_name  median_age  density  density_proportion
a  United Kingdom          40      281            0.463696
b          France          42      119            0.196370
c           Italy          46      206            0.339934

In [99]:
data_df.T

                                 a        b         c
country_name        United Kingdom   France     Italy
median_age                      40       42        46
density                        281      119       206
density_proportion        0.463696  0.19637  0.339934

In [100]:
# What we have done here is turn the DataFrame the other way so now the columns are the index. 
# To loop over it we use the 'iteritems' method.

for n in data_df.T.iteritems():
    print(n)

('a', country_name          United Kingdom
median_age                        40
density                          281
density_proportion          0.463696
Name: a, dtype: object)
('b', country_name           France
median_age                 42
density                   119
density_proportion    0.19637
Name: b, dtype: object)
('c', country_name             Italy
median_age                  46
density                    206
density_proportion    0.339934
Name: c, dtype: object)

In [101]:
# What we see here is that when we use the iteritems method over the data frame and at each instance 
# of the loop it returns a two element tuple. 
# The first element is the index and the second the values in the row stored in a series. 
# The better way to access it would be to assign each element to a variable allowing us to have better access to each part.

for ind, row in data_df.T.iteritems():
    print(ind)
    print(row)

a
country_name          United Kingdom
median_age                        40
density                          281
density_proportion          0.463696
Name: a, dtype: object
b
country_name           France
median_age                 42
density                   119
density_proportion    0.19637
Name: b, dtype: object
c
country_name             Italy
median_age                  46
density                    206
density_proportion    0.339934
Name: c, dtype: object

In [102]:
for ind, row in data_df.T.iteritems():
    print(ind)
    print(row["country_name"])
    
# We assign the first element of the tuple to the variable ind and the series of the row in the variable row. 
# Then we access the country column of that row and show it here with the index. 
# Also we can avoid using the transpose of the dataframe by directly accessing the row via the 'iterrows' method.

a
United Kingdom
b
France
c
Italy

In [103]:
for ind, row in data_df.iterrows():
    print(ind)
    print(row)

a
country_name          United Kingdom
median_age                        40
density                          281
density_proportion          0.463696
Name: a, dtype: object
b
country_name           France
median_age                 42
density                   119
density_proportion    0.19637
Name: b, dtype: object
c
country_name             Italy
median_age                  46
density                    206
density_proportion    0.339934
Name: c, dtype: object

In [104]:
# We have looked at how to add columns to a data frame but now we will look at how to add rows. 
# The way we will consider is using the 'append' method on dataframes. 
# We do so as follows:

data = [{"country":"United Kingdom", "median_age":40, "density":281},
       {"country":"France", "median_age":42, "density":119},
       {"country":"Italy", "median_age":46, "density":206}]
data

[{'country': 'United Kingdom', 'median_age': 40, 'density': 281},
 {'country': 'France', 'median_age': 42, 'density': 119},
 {'country': 'Italy', 'median_age': 46, 'density': 206}]

In [105]:
data_df = pd.DataFrame(data)
data_df

          country  median_age  density
0  United Kingdom          40      281
1          France          42      119
2           Italy          46      206

In [106]:
new_row = [{"country":"Iceland", "median_age":37, "density":3}]

In [107]:
new_row_data_df = pd.DataFrame(new_row)

In [108]:
new_row_data_df

   country  median_age  density
0  Iceland          37        3

In [109]:
data_df.append(new_row_data_df)

          country  median_age  density
0  United Kingdom          40      281
1          France          42      119
2           Italy          46      206
0         Iceland          37        3

In [110]:
data_df

          country  median_age  density
0  United Kingdom          40      281
1          France          42      119
2           Italy          46      206

In [111]:
# So, we setup the initial data as we have done earlier but here make a fresh copy of the original data. 
# We then setup a DataFrame of the new row and pass that into the 'append' method of the original dataframe. 
# What we then see is the DataFrame containing the new row.
# However, it has an index of zero which we already had in the original DataFrame. 
# We also see that when we call the DataFrame after this operation it no longer has the new row.
# If we look at the index problem we can resolve this by using the argument ignore_index as follows:

data_df.append(new_row_data_df, ignore_index=True)

          country  median_age  density
0  United Kingdom          40      281
1          France          42      119
2           Italy          46      206
3         Iceland          37        3

In [112]:
data_df

          country  median_age  density
0  United Kingdom          40      281
1          France          42      119
2           Italy          46      206

In [113]:
# So that is sorted but what about the fact that the new row hasn’t become part of the data frame. 
# Well to get that to work we need to assign the data frame to a new variable as the append method doesn’t change 
# the original DataFrame. 
# We could re-assign the data frame to the same name data_df, however we would lose the memory of what we have done so
# we could assign it to a new variable.

new_data_df = data_df.append(new_row_data_df)
new_data_df

          country  median_age  density
0  United Kingdom          40      281
1          France          42      119
2           Italy          46      206
0         Iceland          37        3

In [114]:
# Merge, Join, and Concatenation

# Initially, we will consider the concept of concatenating DataFrames. 
# The manner in which we can do this is to create a list of DataFrames and pass them into the 'concat' method.
# These DataFrames will build on what we have looked at in the previous chapter by using the following country data:

df1 = pd.DataFrame({"density":[119,206,240,94],
                   "median_age":[42,47,46,45],
                   "population":[65,60,83,46],
                   "population_change":[0.22,-0.15,0.32,0.04]},
                  index=["France","Italy","Germany","Spain"])

df2 = pd.DataFrame({"density":[153, 464, 36, 25],
                   "median_age":[38, 28, 38, 33],
                   "population":[1439, 1380, 331, 212],
                   "population_change":[0.39, 0.99, 0.59, 0.72]},
                  index=["China","India","USA","Brazil"])

df3 = pd.DataFrame({"density":[9, 66, 347, 103],
                   "median_age":[40, 29, 48, 25],
                   "population":[145, 128, 126, 102],
                   "population_change":[0.04, 1.06, -0.30, 1.94]},
                  index=["Russia","Mexico","Japan","Egypt"])

frames = [df1,df2,df3]
result = pd.concat(frames)
result

         density  median_age  population  population_change
France       119          42          65               0.22
Italy        206          47          60              -0.15
Germany      240          46          83               0.32
Spain         94          45          46               0.04
China        153          38        1439               0.39
India        464          28        1380               0.99
USA           36          38         331               0.59
Brazil        25          33         212               0.72
Russia         9          40         145               0.04
Mexico        66          29         128               1.06
Japan        347          48         126              -0.30
Egypt        103          25         102               1.94

In [115]:
result2 = pd.concat([df1,df2,df3])
result2

         density  median_age  population  population_change
France       119          42          65               0.22
Italy        206          47          60              -0.15
Germany      240          46          83               0.32
Spain         94          45          46               0.04
China        153          38        1439               0.39
India        464          28        1380               0.99
USA           36          38         331               0.59
Brazil        25          33         212               0.72
Russia         9          40         145               0.04
Mexico        66          29         128               1.06
Japan        347          48         126              -0.30
Egypt        103          25         102               1.94

In [116]:
# What we did was to create a list of DataFrames and then by passing them into the pd.concat method. 
# We get the result shown which is DataFrame with columns density, median_age, population, population_change 
# and rows indexed with country names. 
# But what if we did not have the index values as shown in the example:

df1 = pd.DataFrame({"density":[119, 206, 240, 94],
                   "median_age":[42, 47, 46, 45],
                   "population":[65, 60, 83, 46],
                   "population_change":[0.22, -0.15, 0.32, 0.04],
                   "country_name":['France', 'Italy', 'Germany', 'Spain']})

df2 = pd.DataFrame({"density":[153, 464, 36, 25],
                   "median_age":[38, 28, 38, 33],
                   "population":[1439, 1380, 331, 212],
                   "population_change":[0.39, 0.99, 0.59, 0.72],
                   "country_name":['China', 'India', 'USA', 'Brazil']})

df3 = pd.DataFrame({"density":[9, 66, 347, 103],
                  "median_age":[40, 29, 48, 25],
                  "population":[145, 128, 126, 102],
                  "population_change":[0.04, 1.06, -0.30, 1.94],
                  "country_name":['Russia', 'Mexico', 'Japan', 'Egypt']})

In [117]:
frames = [df1,df2,df3]
result = pd.concat(frames)
result

   density  median_age  population  population_change country_name
0      119          42          65               0.22       France
1      206          47          60              -0.15        Italy
2      240          46          83               0.32      Germany
3       94          45          46               0.04        Spain
0      153          38        1439               0.39        China
1      464          28        1380               0.99        India
2       36          38         331               0.59          USA
3       25          33         212               0.72       Brazil
0        9          40         145               0.04       Russia
1       66          29         128               1.06       Mexico
2      347          48         126              -0.30        Japan
3      103          25         102               1.94        Egypt

In [118]:
# Here, we see that the index is retained for each DataFrame which when created all have the index 0, 1, 2, 3. 
# To have an index 0–11 we need to use the ignore_index argument and set it to True.

result = pd.concat(frames, ignore_index=True)
result

    density  median_age  population  population_change country_name
0       119          42          65               0.22       France
1       206          47          60              -0.15        Italy
2       240          46          83               0.32      Germany
3        94          45          46               0.04        Spain
4       153          38        1439               0.39        China
5       464          28        1380               0.99        India
6        36          38         331               0.59          USA
7        25          33         212               0.72       Brazil
8         9          40         145               0.04       Russia
9        66          29         128               1.06       Mexico
10      347          48         126              -0.30        Japan
11      103          25         102               1.94        Egypt

In [119]:
# We can expand on this example by creating a list of DataFrames as we did previously and concat them together 
# but now we use the argument keys and set it to a list containing region one, region two, and region three.
# However, you can't add-up ignore_index=True together as the argument keys will be ignored.

result = pd.concat(frames, keys=["Region One", "Region Two", "Region Three"])
result

                density  median_age  population  population_change  \
Region One   0      119          42          65               0.22
             1      206          47          60              -0.15
             2      240          46          83               0.32
             3       94          45          46               0.04
Region Two   0      153          38        1439               0.39
             1      464          28        1380               0.99
             2       36          38         331               0.59
             3       25          33         212               0.72
Region Three 0        9          40         145               0.04
             1       66          29         128               1.06
             2      347          48         126              -0.30
             3      103          25         102               1.94

               country_name
Region One   0       France
             1        Italy
             2      Germany
             3        Spain
Region Two   0        China
             1        India
             2          USA
             3       Brazil
Region Three 0       Russia
             1       Mexico
             2        Japan
             3        Egypt

In [120]:
result.loc["Region Two"]

   density  median_age  population  population_change country_name
0      153          38        1439               0.39        China
1      464          28        1380               0.99        India
2       36          38         331               0.59          USA
3       25          33         212               0.72       Brazil

In [121]:
# In running the code what we see is that passing the keys in means we have what appears to be 
# another level of the DataFrame away from our index in the previous example which allows us 
# to select the one of the DataFrames used in the concat. 
# If we look at the index of the result we get the following:

result.index

MultiIndex([(  'Region One', 0),
            (  'Region One', 1),
            (  'Region One', 2),
            (  'Region One', 3),
            (  'Region Two', 0),
            (  'Region Two', 1),
            (  'Region Two', 2),
            (  'Region Two', 3),
            ('Region Three', 0),
            ('Region Three', 1),
            ('Region Three', 2),
            ('Region Three', 3)],
           )

In [122]:
# This is commonly referred to a multilevel index as the name would suggest and what it does is tell us 
# what the index value each element has. 
# So the levels are [“region_one”, “region_two”, “region_three”] and [0, 1, 2, 3], which are denoted in levels. 
# The index for each row is then determined using the label which has two lists of eight elements with the first 
# one having values 0, 1, 2 which corresponds to region one, region two and region three whilst the second has 
# values 0, 1, 2, 3 which refer to the levels 0, 1, 2, 3. 
# We could name these levels by using the optional name argument.

result = pd.concat(frames, keys=["Region_One","Region_Two","Region_Three"], names=["Region","Item"])
result

                   density  median_age  population  population_change  \
Region       Item
Region_One   0         119          42          65               0.22
             1         206          47          60              -0.15
             2         240          46          83               0.32
             3          94          45          46               0.04
Region_Two   0         153          38        1439               0.39
             1         464          28        1380               0.99
             2          36          38         331               0.59
             3          25          33         212               0.72
Region_Three 0           9          40         145               0.04
             1          66          29         128               1.06
             2         347          48         126              -0.30
             3         103          25         102               1.94

                  country_name
Region       Item
Region_One   0          France
             1           Italy
             2         Germany
             3           Spain
Region_Two   0           China
             1           India
             2             USA
             3          Brazil
Region_Three 0          Russia
             1          Mexico
             2           Japan
             3           Egypt

In [123]:
# In the previous example we used concat to concatenate the DataFrames together.
# However, there are other ways to use it which we will demonstrate now by concatenating urban 
# population percentage from France, Italy, Argentina, and Thailand to our initial DataFrame.

df1 = pd.DataFrame({"density":[119, 206, 240, 94],
                   "median_age":[42, 47, 46, 45],
                   "population":[65, 60, 83, 46],
                   "population_change":[0.22, -0.15, 0.32, 0.04]},
                  index=['France', 'Italy', 'Germany', 'Spain'])

df4 = pd.DataFrame({"urban_population":[82, 69, 93, 51]},
                  index=['France', 'Italy', 'Argentina', 'Thailand'])

In [124]:
pd.concat([df1,df4], axis=1, sort=False)

,density,median_age,population,population_change,urban_population
France,119.0,42.0,65.0,0.22,82.0
Italy,206.0,47.0,60.0,-0.15,69.0
Germany,240.0,46.0,83.0,0.32,NaN
Spain,94.0,45.0,46.0,0.04,NaN
Argentina,NaN,NaN,NaN,NaN,93.0
Thailand,NaN,NaN,NaN,NaN,51.0

In [125]:
# Here, we have used concat with a list of DataFrames as we have done before but now we pass in the argument axis = 1. 
# Now, the axis argument says we concatenate on the columns, here 0 is index and 1 is columns. 
# So, we see commonality in the index with France and Italy, so we can add the extra column on and fill the values 
# that are not common with NaN. 
# Here, we have set the sort to be False which means we keep the order as if the two were joined one below the other. 
# If we set the value to be True we get the following:

In [126]:
pd.concat([df1,df4], axis=1, sort=True)

,density,median_age,population,population_change,urban_population
Argentina,NaN,NaN,NaN,NaN,93.0
France,119.0,42.0,65.0,0.22,82.0
Germany,240.0,46.0,83.0,0.32,NaN
Italy,206.0,47.0,60.0,-0.15,69.0
Spain,94.0,45.0,46.0,0.04,NaN
Thailand,NaN,NaN,NaN,NaN,51.0

In [127]:
# We can see that with sort set to True we get the values sorted by index order. 
# Below we can also see what happens if we run the same query with the axis set to 0.

pd.concat([df1,df4], axis=0, sort=True)

# What we do is just concatenate the DataFrames one below each other with duplication 
# of the index for France and Italy.

,density,median_age,population,population_change,urban_population
France,119.0,42.0,65.0,0.22,NaN
Italy,206.0,47.0,60.0,-0.15,NaN
Germany,240.0,46.0,83.0,0.32,NaN
Spain,94.0,45.0,46.0,0.04,NaN
France,NaN,NaN,NaN,NaN,82.0
Italy,NaN,NaN,NaN,NaN,69.0
Argentina,NaN,NaN,NaN,NaN,93.0
Thailand,NaN,NaN,NaN,NaN,51.0

In [128]:
# Concat also has an extra argument join that we will now explore and set the value to join.

pd.concat([df1,df4], axis=1, join="inner")

# As you can see we only have two rows returned which if you look back at the example
# before are the only two rows where the two DataFrames have values in columns. 
# The inner join is similar to that of a database join.
# However, here we don’t specify a key to use it on.

        density  median_age  population  population_change  urban_population
France      119          42          65               0.22                82
Italy       206          47          60              -0.15                69

In [129]:
# Next, we add argument join_axes and set it to df1.index.

result = pd.concat([df1, df4], axis=1).reindex(df1.index)
result

# What we see is that all we get back only the values for in the index in df1 and show all
# the columns from the axis 1 argument. 
# By default the join_axes are set to False.

# Join_axes is deprecated. The supported way is now .reindex(df1.columns).

         density  median_age  population  population_change  urban_population
France     119.0        42.0        65.0               0.22              82.0
Italy      206.0        47.0        60.0              -0.15              69.0
Germany    240.0        46.0        83.0               0.32               NaN
Spain       94.0        45.0        46.0               0.04               NaN

In [130]:
# Next, we will ignore the index by using the following arguments:

pd.concat([df1,df4], ignore_index=True, sort=True)

# Here, we see the result has lost index values from df1 and df2 and retained all the information 
# filling the missing values with NaN.

   density  median_age  population  population_change  urban_population
0    119.0        42.0        65.0               0.22               NaN
1    206.0        47.0        60.0              -0.15               NaN
2    240.0        46.0        83.0               0.32               NaN
3     94.0        45.0        46.0               0.04               NaN
4      NaN         NaN         NaN                NaN              82.0
5      NaN         NaN         NaN                NaN              69.0
6      NaN         NaN         NaN                NaN              93.0
7      NaN         NaN         NaN                NaN              51.0

In [131]:
# We can achieve the same thing using the 'append' method directly on a DataFrame.

df1.append(df4, ignore_index=True, sort=True)

   density  median_age  population  population_change  urban_population
0    119.0        42.0        65.0               0.22               NaN
1    206.0        47.0        60.0              -0.15               NaN
2    240.0        46.0        83.0               0.32               NaN
3     94.0        45.0        46.0               0.04               NaN
4      NaN         NaN         NaN                NaN              82.0
5      NaN         NaN         NaN                NaN              69.0
6      NaN         NaN         NaN                NaN              93.0
7      NaN         NaN         NaN                NaN              51.0

In [132]:
# The concat method is not only valid for DataFrames but can also work on Series.

df1 = pd.DataFrame({"density":[119, 206, 240, 94],
                   "median_age":[42, 47, 46, 45],
                   "population":[65, 60, 83, 46],
                   "population_change":[0.22, -0.15, 0.32, 0.04]},
                  index=['France', 'Italy', 'Germany', 'Spain'])

s1 = pd.Series([82, 69, 93, 51], index=['France', 'Italy', 'Germany', 'Spain'], name="urban_population")

In [133]:
df1

         density  median_age  population  population_change
France       119          42          65               0.22
Italy        206          47          60              -0.15
Germany      240          46          83               0.32
Spain         94          45          46               0.04

In [134]:
s1

France     82
Italy      69
Germany    93
Spain      51
Name: urban_population, dtype: int64

In [135]:
pd.concat([df1,s1], axis=0)

         density  median_age  population  population_change     0
France     119.0        42.0        65.0               0.22   NaN
Italy      206.0        47.0        60.0              -0.15   NaN
Germany    240.0        46.0        83.0               0.32   NaN
Spain       94.0        45.0        46.0               0.04   NaN
France       NaN         NaN         NaN                NaN  82.0
Italy        NaN         NaN         NaN                NaN  69.0
Germany      NaN         NaN         NaN                NaN  93.0
Spain        NaN         NaN         NaN                NaN  51.0

In [136]:
pd.concat([df1,s1], axis=1)

         density  median_age  population  population_change  urban_population
France       119          42          65               0.22                82
Italy        206          47          60              -0.15                69
Germany      240          46          83               0.32                93
Spain         94          45          46               0.04                51

In [137]:
# What is worth noting is that we give the series a name and then that is set to be 
# the name of the column when the two are concatenated together. 
# We could also pass in multiple series in the list and we will add a second series with world share percentage.

s2 = pd.Series([0.84, 0.78, 1.07, 0.60], index=['France', 'Italy', 'Germany', 'Spain'], name="world_share")
s2

France     0.84
Italy      0.78
Germany    1.07
Spain      0.60
Name: world_share, dtype: float64

In [138]:
pd.concat([df1,s1,s2], axis=1)

,density,median_age,population,population_change,urban_population,world_share
France,119,42,65,0.22,82,0.84
Italy,206,47,60,-0.15,69,0.78
Germany,240,46,83,0.32,93,1.07
Spain,94,45,46,0.04,51,0.60

In [139]:
# Next, we pass in series as a list to create a DataFrame and by specifying keys we can rename the columns.

s1 = pd.Series([82, 69, 93, 51], index=['France', 'Italy', 'Germany', 'Spain'], name='urban_population')
s2 = pd.Series([0.84, 0.78, 1.07, 0.60], index=['France', 'Italy', 'Germany', 'Spain'], name='world_share')
pd.concat([s1,s2])

France     82.00
Italy      69.00
Germany    93.00
Spain      51.00
France      0.84
Italy       0.78
Germany     1.07
Spain       0.60
dtype: float64

In [140]:
pd.concat([s1,s2], axis=1)

         urban_population  world_share
France                 82         0.84
Italy                  69         0.78
Germany                93         1.07
Spain                  51         0.60

In [141]:
pd.concat([s1,s2], axis=1, keys=['urban population','world share'])

         urban population  world share
France                 82         0.84
Italy                  69         0.78
Germany                93         1.07
Spain                  51         0.60

In [142]:
# Next, we take our three DataFrames from before and assign them to a dictionary each with a key. 
# The dictionary is then passed into concat.

df1 = pd.DataFrame({"density":[119, 206, 240, 94],
                    "median_age":[42, 47, 46, 45],
                    "population":[65, 60, 83, 46],
                    "population_change":[0.22, -0.15, 0.32, 0.04]},
                  index=['France', 'Italy', 'Germany', 'Spain'])

df2 = pd.DataFrame({"density":[153, 464, 36, 25],
                    "median_age":[38, 28, 38, 33],
                    "population":[1439, 1380, 331, 212],
                    "population_change":[0.39, 0.99, 0.59, 0.72]},
                  index=['China', 'India', 'USA', 'Brazil'])

df3 = pd.DataFrame({"density":[9, 66, 347, 103],
                    "median_age":[40, 29, 48, 25],
                    "population":[145, 128, 126, 102],
                    "population_change":[0.04, 1.06, -0.30, 1.94]},
                  index=['Russia', 'Mexico', 'Japan', 'Egypt'])

pieces = {"region 1":df1, "region 2":df2, "region 3":df3}
pd.concat(pieces)

                  density  median_age  population  population_change
region 1 France       119          42          65               0.22
         Italy        206          47          60              -0.15
         Germany      240          46          83               0.32
         Spain         94          45          46               0.04
region 2 China        153          38        1439               0.39
         India        464          28        1380               0.99
         USA           36          38         331               0.59
         Brazil        25          33         212               0.72
region 3 Russia         9          40         145               0.04
         Mexico        66          29         128               1.06
         Japan        347          48         126              -0.30
         Egypt        103          25         102               1.94

In [143]:
# In using a dictionary we automatically create a DataFrame with a multilevel index where
# the first level is the key of the dictionary and the second level the index of the DataFrame.
# We next do exactly the same but here pass in an optional keys list.

pd.concat(pieces, keys=["region 2","region 3"])

                 density  median_age  population  population_change
region 2 China       153          38        1439               0.39
         India       464          28        1380               0.99
         USA          36          38         331               0.59
         Brazil       25          33         212               0.72
region 3 Russia        9          40         145               0.04
         Mexico       66          29         128               1.06
         Japan       347          48         126              -0.30
         Egypt       103          25         102               1.94

In [144]:
# Having looked at the concat and append methods, we now consider how pandas deals with database styles merging.
# This is all done via the 'merge' method. 
# We will explain the specifics around each join type by example. 
# However, it is worth explaining the basics of database joins. 
# So, when we speak of database style joins, we mean the mechanism to join tables together via common values. 
# The way in which the tables will look will depend on the type of join. 
# For examples, inner, outer, right, and left joins.

In [145]:
# We will develop the example of country data to combine DataFrames that contain data relating to common countries
# and now add in the data for the countries relating to the percentage world share.

left = pd.DataFrame({"density":[119, 206, 240, 94],
                    "median_age":[42, 47, 46, 45],
                    "population":[65, 60, 83, 46],
                    "population_change":[0.22, -0.15, 0.32, 0.04],
                    "country":['France', 'Italy', 'Germany', 'Spain']})
left

   density  median_age  population  population_change  country
0      119          42          65               0.22   France
1      206          47          60              -0.15    Italy
2      240          46          83               0.32  Germany
3       94          45          46               0.04    Spain

In [146]:
right = pd.DataFrame({"world_share":[0.84, 0.78, 1.07, 0.60],
                     "country":['France', 'Italy', 'Germany', 'Spain']})
right

   world_share  country
0         0.84   France
1         0.78    Italy
2         1.07  Germany
3         0.60    Spain

In [147]:
pd.merge(left, right, on="country")

   density  median_age  population  population_change  country  world_share
0      119          42          65               0.22   France         0.84
1      206          47          60              -0.15    Italy         0.78
2      240          46          83               0.32  Germany         1.07
3       94          45          46               0.04    Spain         0.60

In [148]:
# In this example, we join two DataFrames on a common key which in this case is the country name. 
# The result is a DataFrame with only one country column where both left and right are merged.
# In the next example, we look at the merge method with a left and right DataFrame but this time 
# will have two keys to join on which will be passed in as a list to the on argument.
# This allows us to join on multiple values being the same.

left = pd.DataFrame({"density":[119, 206, 240, 94],
                    "median_age":[42, 47, 46, 45],
                    "population":[65, 60, 83, 46],
                    "population_change":[0.22, -0.15, 0.32, 0.04],
                    "country":['France', 'Italy', 'Germany', 'Spain']})
left

   density  median_age  population  population_change  country
0      119          42          65               0.22   France
1      206          47          60              -0.15    Italy
2      240          46          83               0.32  Germany
3       94          45          46               0.04    Spain

In [149]:
right = pd.DataFrame({"world_share":[0.84, 0.78, 1.07, 0.60],
                     "population":[65, 60, 85, 46],
                     "country":['France', 'Italy', 'Germany', 'Spain']})
right

   world_share  population  country
0         0.84          65   France
1         0.78          60    Italy
2         1.07          85  Germany
3         0.60          46    Spain

In [150]:
pd.merge(left, right, on=["country","population"])

   density  median_age  population  population_change country  world_share
0      119          42          65               0.22  France         0.84
1      206          47          60              -0.15   Italy         0.78
2       94          45          46               0.04   Spain         0.60

In [151]:
# Here, we have joined on country and population and the resulting DataFrame is where both DataFrames share 
# the same country and population. 
# So, we lose one row of data from each DataFrame where we do not share the population and country on both.
# Next, we run the same code with an added argument which is how equal to left.

pd.merge(left, right, on=["country","population"], how="left")

   density  median_age  population  population_change  country  world_share
0      119          42          65               0.22   France         0.84
1      206          47          60              -0.15    Italy         0.78
2      240          46          83               0.32  Germany          NaN
3       94          45          46               0.04    Spain         0.60

In [152]:
# The result of this is what is known as a left join. 
# So we retain all the information of the left DataFrame and only the elements from the right DataFrame 
# with the same keys as the left one. 
# In this case we retain all information from the left DataFrame.
# Next we consider a right join using the same example as before:

pd.merge(left, right, on=["country","population"], how='right')

   density  median_age  population  population_change  country  world_share
0    119.0        42.0          65               0.22   France         0.84
1    206.0        47.0          60              -0.15    Italy         0.78
2     94.0        45.0          46               0.04    Spain         0.60
3      NaN         NaN          85                NaN  Germany         1.07

In [153]:
# Essentially, this does the same as the left join. 
# However, its now the left DataFrame that is joined onto the right one which is the reverse
# of what we saw with the left join.
# The next join to consider is the outer join and again for completeness, we use the previous
# example to show how it works.

pd.merge(left, right, how="outer", on=["country","population"])

   density  median_age  population  population_change  country  world_share
0    119.0        42.0          65               0.22   France         0.84
1    206.0        47.0          60              -0.15    Italy         0.78
2    240.0        46.0          83               0.32  Germany          NaN
3     94.0        45.0          46               0.04    Spain         0.60
4      NaN         NaN          85                NaN  Germany         1.07

In [154]:
# With the outer join its a combination of both the left and right joins. 
# So, we have more rows than are in each DataFrame as the join of left and right give different results 
# so we need all of these in the outer join result.
# The last how option we consider is the inner join.

pd.merge(left, right, how="inner", on=["country","population"])

   density  median_age  population  population_change country  world_share
0      119          42          65               0.22  France         0.84
1      206          47          60              -0.15   Italy         0.78
2       94          45          46               0.04   Spain         0.60

In [155]:
# This join gives only the result where we have commonality on both the left and right DataFrame. 
# This is also the default when we do not pass how argument:

pd.merge(left, right, on=["country","population"])

   density  median_age  population  population_change country  world_share
0      119          42          65               0.22  France         0.84
1      206          47          60              -0.15   Italy         0.78
2       94          45          46               0.04   Spain         0.60

In [156]:
# Next, we join two DataFrames with columns population and country but we join only on country using an outer join.

left = pd.DataFrame({"population":[65, 60, 83, 46],
                    "country":['France', 'Italy', 'Germany', 'Spain']})

right = pd.DataFrame({"population":[65, 60, 85, 46],
                     "country":['France', 'Italy', 'Germany', 'Spain']})

pd.merge(left, right, how="outer", on="country")

   population_x  country  population_y
0            65   France            65
1            60    Italy            60
2            83  Germany            85
3            46    Spain            46

In [157]:
# What we see here if the columns are the same and not used in the join the names get changed. 
# Here, we now have population_x and population_y which could be problematic if you are assuming to operate 
# on the column population. 
# This makes sense as we need a way to distinguish the two and pandas takes care of it for us.
# Next, we do a merge using the indicator option set to True. 
# Here, we have two DataFrames with only a single column to merge on which is country and we want to do an outer join.

pd.merge(left, right, on="country", how="outer", indicator=True)

   population_x  country  population_y _merge
0            65   France            65   both
1            60    Italy            60   both
2            83  Germany            85   both
3            46    Spain            46   both

In [158]:
# What the result shows is how the join is done index by index position so this could be left, right, or both. 
# Here, we see that the join from one to the other is done on both.
# The merge method is a pandas method to take account of two DataFrames.
# However we can use a DataFrames join method to join one onto another.

left = pd.DataFrame({"density":[119, 206, 240, 94],
                    "median_age":[42, 47, 46, 45],
                    "population":[65, 60, 83, 46],
                    "population_change":[0.22, -0.15, 0.32, 0.04]},
                   index=['France', 'Italy', 'Germany', 'Spain'])
left

         density  median_age  population  population_change
France       119          42          65               0.22
Italy        206          47          60              -0.15
Germany      240          46          83               0.32
Spain         94          45          46               0.04

In [159]:
right = pd.DataFrame({"World_share":[0.84, 0.78, 1.07, 0.60]},
                    index=['France', 'Italy', 'Germany','United Kingdom'])
right

                World_share
France                 0.84
Italy                  0.78
Germany                1.07
United Kingdom         0.60

In [160]:
left.join(right)

         density  median_age  population  population_change  World_share
France       119          42          65               0.22         0.84
Italy        206          47          60              -0.15         0.78
Germany      240          46          83               0.32         1.07
Spain         94          45          46               0.04          NaN

In [161]:
# What we see is that the left DataFrame is retained and we join the right one where the keys in right match the keys in left. 
# Like with the merge we have the option how to join the DataFrames so we can specify that like we have seen earlier. 
# Using the same example previously we can show this.

left.join(right, how="outer")

,density,median_age,population,population_change,World_share
France,119.0,42.0,65.0,0.22,0.84
Germany,240.0,46.0,83.0,0.32,1.07
Italy,206.0,47.0,60.0,-0.15,0.78
Spain,94.0,45.0,46.0,0.04,NaN
United Kingdom,NaN,NaN,NaN,NaN,0.60

In [162]:
# By using the outer join, we retain all the information from both DataFrames as we have seen when using 'merge' method. 
# And when there is no value in either one of the DataFrames, the cell will be filled in using NaN. 
# Using the same example with an inner join, following result will be shown:

left.join(right, how="inner")

         density  median_age  population  population_change  World_share
France       119          42          65               0.22         0.84
Italy        206          47          60              -0.15         0.78
Germany      240          46          83               0.32         1.07

In [163]:
# As expected, the inner join just retains where the DataFrames have common data 
# which here is for index France, Italy, and Germany.

# We can achieve the same result without using a 'how' if we pass in some different arguments to the 'merge' method. 
# These arguments are left_index and right_index here in setting them to True. 
# We are getting the same behaviour as for the join method with how set to inner.

pd.merge(left, right, right_index=True, left_index=True)

         density  median_age  population  population_change  World_share
France       119          42          65               0.22         0.84
Italy        206          47          60              -0.15         0.78
Germany      240          46          83               0.32         1.07

In [164]:
# Next, we use the argument ‘on’ with the join method when applied to the left DataFrame.

left = pd.DataFrame({"density":[119, 206, 240, 94],
                    "median_age":[42, 47, 46, 45],
                    "population":[65, 60, 83, 46],
                    "population_change":[0.22, -0.15, 0.32, 0.04],
                    "country":['France', 'Italy', 'Germany', 'Spain']})

right = pd.DataFrame({"world_share":[0.84, 0.78, 1.07, 0.60]},
                    index= ['France', 'Italy', 'Germany','United Kingdom'])

left.join(right, on="country")

   density  median_age  population  population_change  country  world_share
0      119          42          65               0.22   France         0.84
1      206          47          60              -0.15    Italy         0.78
2      240          46          83               0.32  Germany         1.07
3       94          45          46               0.04    Spain          NaN

In [165]:
# In specifying the 'on' column, which is country, we join the index of right on this column and we see that we now 
# have a DataFrame indexed by the first DataFrame. 
# This type of approach is what you may see when using databases and you want to join on the id of the column on 
# the respective value in another table. 
# This example can be extended to multiple values in the on argument, however to do this you would require multilevel 
# indexes which will be covered later in the book. 
# We can remove any NaN values by adding the how argument and setting it to inner doing an inner join as shown below.

left

   density  median_age  population  population_change  country
0      119          42          65               0.22   France
1      206          47          60              -0.15    Italy
2      240          46          83               0.32  Germany
3       94          45          46               0.04    Spain

In [166]:
right

                world_share
France                 0.84
Italy                  0.78
Germany                1.07
United Kingdom         0.60

In [167]:
left.join(right, on="country", how="inner")

   density  median_age  population  population_change  country  world_share
0      119          42          65               0.22   France         0.84
1      206          47          60              -0.15    Italy         0.78
2      240          46          83               0.32  Germany         1.07

In [168]:
# The next thing we will consider is the important concept of missing data. 
# We all hope to work with perfect datasets but the reality is we generally won’t and having the ability to work 
# with missing or bad data is an important one. 
# Luckily pandas offers some great tools for dealing with this and we begin by showing how to identify where we 
# have NaN in our dataset.

left = pd.DataFrame({"density":[119, 206, 240, 94],
                    "median_age":[42, 47, 46, 45],
                    "population":[65, 60, 83, 46],
                    "population_change":[0.22, -0.15, 0.32, 0.04],
                    "country":['France', 'Italy', 'Germany', 'Spain']})

right = pd.DataFrame({"world_share":[0.84, 0.78, 1.07, 0.60],
                     "population":[65, 60, 85, 46],
                     "country":['France', 'Italy', 'Germany', 'Spain']})

result = pd.merge(left, right, how="outer", on=["country","population"])
result

   density  median_age  population  population_change  country  world_share
0    119.0        42.0          65               0.22   France         0.84
1    206.0        47.0          60              -0.15    Italy         0.78
2    240.0        46.0          83               0.32  Germany          NaN
3     94.0        45.0          46               0.04    Spain         0.60
4      NaN         NaN          85                NaN  Germany         1.07

In [169]:
pd.isna(result)

   density  median_age  population  population_change  country  world_share
0    False       False       False              False    False        False
1    False       False       False              False    False        False
2    False       False       False              False    False         True
3    False       False       False              False    False        False
4     True        True       False               True    False        False

In [170]:
pd.isna(result["density"])

0    False
1    False
2    False
3    False
4     True
Name: density, dtype: bool

In [171]:
result["median_age"].notna()

0     True
1     True
2     True
3     True
4    False
Name: median_age, dtype: bool

In [172]:
result.isna()

   density  median_age  population  population_change  country  world_share
0    False       False       False              False    False        False
1    False       False       False              False    False        False
2    False       False       False              False    False         True
3    False       False       False              False    False        False
4     True        True       False               True    False        False

In [173]:
# Here, we have taken the DataFrames we have seen before and created a result DataFrame using the 'merge' method 
# with how set to outer. 
# What this has done is given us a DataFrame with NaN values and we can now demonstrate how you can find where 
# these values are within your DataFrame. 
# We first consider the pandas 'isna' method on a column of the DataFrame which tests each element to see what is 
# and what isn’t NaN. 
# To achieve the same thing, we can use the 'notna' method on a column or all of our DataFrame, or we could use 
# 'isna' method which does the opposite of 'notna'. 
# This makes it very easy to determine what is and what isn’t NaN in our DataFrame.

result

   density  median_age  population  population_change  country  world_share
0    119.0        42.0          65               0.22   France         0.84
1    206.0        47.0          60              -0.15    Italy         0.78
2    240.0        46.0          83               0.32  Germany          NaN
3     94.0        45.0          46               0.04    Spain         0.60
4      NaN         NaN          85                NaN  Germany         1.07

In [174]:
result["density"].dropna()

0    119.0
1    206.0
2    240.0
3     94.0
Name: density, dtype: float64

In [175]:
result["density"].notna()

0     True
1     True
2     True
3     True
4    False
Name: density, dtype: bool

In [176]:
result[result["density"].notna()]

   density  median_age  population  population_change  country  world_share
0    119.0        42.0          65               0.22   France         0.84
1    206.0        47.0          60              -0.15    Italy         0.78
2    240.0        46.0          83               0.32  Germany          NaN
3     94.0        45.0          46               0.04    Spain         0.60

In [177]:
# Taking the example one step further we can drop values from a column of the whole DataFrame by using the 'dropna' method. 
# For the column we only drop the one value that is NaN.
# However, across the whole DataFrame we remove any row that has NaN in it. 
# This may not be ideal and instead we may want to remove the row where one column has NaN and we can do that by passing 
# and columns notna to the whole DataFrame.

In [178]:
# DataFrame Methods

# Now, in the next example, we will show some of the methods we can apply to a DataFrame.
# Earlier we demonstrated the sum method, however pandas has lots more to offer and we will look 
# at some of the more common mathematical ones. 
# Here, we import the package seaborn and load the iris dataset that comes with it giving us the data in a DataFrame.

import seaborn as sns

iris = sns.load_dataset('iris')

In [179]:
iris.head(10)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

In [180]:
iris["sepal_length"].head()

0    5.1
1    4.9
2    4.7
3    4.6
4    5.0
Name: sepal_length, dtype: float64

In [181]:
iris.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [182]:
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [183]:
# Following importing the package and the iris data we can access the top of the DataFrame by using head which 
# by default gives us the top five rows, we can use the tail method to get the bottom five rows. 
# We can get a defined number of rows by just passing the number into the head or tail method and if we want just 
# the columns back we can use the columns method.
# Having imported and accessed the data we now demonstrate some methods which we can apply.

iris.count()

sepal_length    150
sepal_width     150
petal_length    150
petal_width     150
species         150
dtype: int64

In [184]:
iris.count().sepal_length

150

In [185]:
iris["sepal_length"].count()

150

In [186]:
len(iris)

150

In [187]:
# We can apply count to both the DataFrame and the column. 
# When applied to the DataFrame we return the length of each column. 
# We can also get the specific column length by either using the column name on the end of the count method or by accessing
# the column and then applying the count method. 
# If you want the number of rows in the DataFrame as a whole you can use the len method on DataFrame.

iris.corr()

              sepal_length  sepal_width  petal_length  petal_width
sepal_length      1.000000    -0.117570      0.871754     0.817941
sepal_width      -0.117570     1.000000     -0.428440    -0.366126
petal_length      0.871754    -0.428440      1.000000     0.962865
petal_width       0.817941    -0.366126      0.962865     1.000000

In [188]:
iris.corr()["petal_length"]

sepal_length    0.871754
sepal_width    -0.428440
petal_length    1.000000
petal_width     0.962865
Name: petal_length, dtype: float64

In [189]:
iris.corr()["petal_length"]["sepal_length"]

0.8717537758865828

In [190]:
iris.cov()

              sepal_length  sepal_width  petal_length  petal_width
sepal_length      0.685694    -0.042434      1.274315     0.516271
sepal_width      -0.042434     0.189979     -0.329656    -0.121639
petal_length      1.274315    -0.329656      3.116278     1.295609
petal_width       0.516271    -0.121639      1.295609     0.581006

In [191]:
iris.cov()["sepal_length"]

sepal_length    0.685694
sepal_width    -0.042434
petal_length    1.274315
petal_width     0.516271
Name: sepal_length, dtype: float64

In [192]:
iris.cov()["sepal_length"]["sepal_width"]

-0.04243400447427296

In [193]:
# The corr method applied to the DataFrame gives us the correlation between each variable 
# and we can limit that to one columns correlation with all others by passing the column 
# name or get the correlation between two columns by passing both column names. 
# You can also see the same applies with the cov method which calculates the covariance between variables.

In [194]:
# Next, we consider the cumsum method. This provides the cumulative sum as the columns ascend. 
# Now, for those columns of numeric type the value ascends as expected with the current value added 
# to the previous value and so on to create an increasing value. 
# The difference comes when we consider a character-based column. 
# The cumulative value here is just the concatenation of the values together with the results looking very strange. 
# To make things easier to read we can restrict what we show for the return of the method by specifying a list
# of the columns to show and as you can see we can even chain the tail command on the end.

iris.cumsum()

,sepal_length,sepal_width,petal_length,petal_width,species
0,5.1,3.5,1.4,0.2,setosa
1,10.0,6.5,2.8,0.4,setosasetosa
2,14.7,9.7,4.1,0.6,setosasetosasetosa
3,19.3,12.8,5.6,0.8,setosasetosasetosasetosa
4,24.3,16.4,7.0,1.0,setosasetosasetosasetosasetosa
...,...,...,...,...,...
145,851.6,446.7,543.0,171.9,setosasetosasetosasetosasetosasetosasetosaseto...
146,857.9,449.2,548.0,173.8,setosasetosasetosasetosasetosasetosasetosaseto...
147,864.4,452.2,553.2,175.8,setosasetosasetosasetosasetosasetosasetosaseto...
148,870.6,455.6,558.6,178.1,setosasetosasetosasetosasetosasetosasetosaseto...
149,876.5,458.6,563.7,179.9,setosasetosasetosasetosasetosasetosasetosaseto...

In [195]:
iris.cumsum().tail()

,sepal_length,sepal_width,petal_length,petal_width,species
145,851.6,446.7,543.0,171.9,setosasetosasetosasetosasetosasetosasetosaseto...
146,857.9,449.2,548.0,173.8,setosasetosasetosasetosasetosasetosasetosaseto...
147,864.4,452.2,553.2,175.8,setosasetosasetosasetosasetosasetosasetosaseto...
148,870.6,455.6,558.6,178.1,setosasetosasetosasetosasetosasetosasetosaseto...
149,876.5,458.6,563.7,179.9,setosasetosasetosasetosasetosasetosasetosaseto...

In [196]:
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [197]:
iris.cumsum()[['sepal_length', 'sepal_width', 'petal_length', 'petal_width']].tail()

     sepal_length  sepal_width  petal_length  petal_width
145         851.6        446.7         543.0        171.9
146         857.9        449.2         548.0        173.8
147         864.4        452.2         553.2        175.8
148         870.6        455.6         558.6        178.1
149         876.5        458.6         563.7        179.9

In [198]:
# We use the 'describe' method which gives us a number of values namely the count, mean, standard deviation, 
# minimum, maximum and the 25, 50, and 75 percentiles.
# This method only works on columns with the type to calculate the values so we not the column species is not included. 
# We can also use this on individual columns, the manner in which we have done this in the example is not to use the 
# square bracket method to accessing a column but instead the dot approach where we can use dot and the column name 
# to access the value and then chain the describe method on the end.

iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [199]:
iris.sepal_length.describe()

count    150.000000
mean       5.843333
std        0.828066
min        4.300000
25%        5.100000
50%        5.800000
75%        6.400000
max        7.900000
Name: sepal_length, dtype: float64

In [200]:
# Next, we consider the max value. 
# Here, when applied to the entire DataFrame we get the max of every column where a maximum value can be obtained. 
# We also show that we can apply the method on a column in the same manner as we showed in the previous example.

iris.max()

sepal_length          7.9
sepal_width           4.4
petal_length          6.9
petal_width           2.5
species         virginica
dtype: object

In [201]:
iris.sepal_length.max()

7.9

In [202]:
iris.sepal_width.mean()

3.057333333333334

In [203]:
# columns

iris.mean(axis=0)

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [204]:
(iris.iloc[0,0] + iris.iloc[0,1] + iris.iloc[0,2] + iris.iloc[0,3]) / 4

2.55

In [205]:
(iris.iloc[1][0] + iris.iloc[1][1] + iris.iloc[1][2] + iris.iloc[1][3]) / 4

2.375

In [206]:
# rows

iris.mean(axis=1)

0      2.550
1      2.375
2      2.350
3      2.350
4      2.550
       ...
145    4.300
146    3.925
147    4.175
148    4.325
149    3.950
Length: 150, dtype: float64

In [207]:
iris.mean(1).head()

0    2.550
1    2.375
2    2.350
3    2.350
4    2.550
dtype: float64

In [208]:
iris.mean(1).tail()

145    4.300
146    3.925
147    4.175
148    4.325
149    3.950
dtype: float64

In [209]:
# The next method we look at is the mean which is a common calculation that you may want to make 
# and as before we can apply it on an individual column and we have done so here using the dot syntax. 
# We then apply the mean method but now pass in a 0 or 1 referring to whether we want to apply across columns or rows. 
# There are a number of different methods that you can apply to a DataFrame and a list of some of the more useful ones is 
# given below:

# ● median: returns the arithmetic median
# ● min: returns the minimum value
# ● max: returns the maximum value
# ● mode: returns the most frequent number
# ● std: returns the standard deviation
# ● sum: returns the arithmetic sum
# ● var: returns the variance

# These are demonstrated as follows:

import seaborn as sns
iris = sns.load_dataset("iris")

In [210]:
iris.sepal_length.median()

5.8

In [211]:
iris.sepal_length.min()

4.3

In [212]:
iris.sepal_length.mode()

0    5.0
dtype: float64

In [213]:
iris.sepal_length.max()

7.9

In [214]:
iris.sepal_length.std()

0.8280661279778629

In [215]:
iris.sepal_length.sum()

876.5

In [216]:
iris.sepal_length.var()

0.6856935123042505

In [217]:
# Missing Data

# We next consider methods we can apply across the DataFrame and how missing data is dealt with. 
# Here, we set the DataFrame up in the way we have done so far in the section and introduce some 
# NaN entries into the DataFrame.

data = pd.DataFrame({"A":[1, 2.1, np.nan, 4.7, 5.6, 6.8],
                    "B":[.25, np.nan, np.nan, 4, 12.2, 14.4]})
data

     A      B
0  1.0   0.25
1  2.1    NaN
2  NaN    NaN
3  4.7   4.00
4  5.6  12.20
5  6.8  14.40

In [218]:
data.dropna(axis=0)

     A      B
0  1.0   0.25
3  4.7   4.00
4  5.6  12.20
5  6.8  14.40

In [219]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [220]:
data

     A      B
0  1.0   0.25
1  2.1    NaN
2  NaN    NaN
3  4.7   4.00
4  5.6  12.20
5  6.8  14.40

In [221]:
data.where(pd.notna(data), data.mean(), axis="columns")

      A        B
0  1.00   0.2500
1  2.10   7.7125
2  4.04   7.7125
3  4.70   4.0000
4  5.60  12.2000
5  6.80  14.4000

In [222]:
data.fillna(data.mean()["B":"C"])

     A        B
0  1.0   0.2500
1  2.1   7.7125
2  NaN   7.7125
3  4.7   4.0000
4  5.6  12.2000
5  6.8  14.4000

In [223]:
data.fillna(data.mean())

      A        B
0  1.00   0.2500
1  2.10   7.7125
2  4.04   7.7125
3  4.70   4.0000
4  5.60  12.2000
5  6.80  14.4000

In [224]:
data.fillna(method="pad")

     A      B
0  1.0   0.25
1  2.1   0.25
2  2.1   0.25
3  4.7   4.00
4  5.6  12.20
5  6.8  14.40

In [225]:
data.fillna(method="bfill")

     A      B
0  1.0   0.25
1  2.1   4.00
2  4.7   4.00
3  4.7   4.00
4  5.6  12.20
5  6.8  14.40

In [226]:
data.interpolate()

     A      B
0  1.0   0.25
1  2.1   1.50
2  3.4   2.75
3  4.7   4.00
4  5.6  12.20
5  6.8  14.40

In [227]:
data.interpolate(method="barycentric")

      A       B
0  1.00   0.250
1  2.10  -7.660
2  3.53  -4.515
3  4.70   4.000
4  5.60  12.200
5  6.80  14.400

In [228]:
data.interpolate(method="spline", order=2)

          A          B
0  1.000000   0.250000
1  2.100000  -0.428598
2  3.404545   1.206900
3  4.700000   4.000000
4  5.600000  12.200000
5  6.800000  14.400000

In [229]:
data.interpolate(method="polynomial", order=2)

          A          B
0  1.000000   0.250000
1  2.100000  -2.703846
2  3.451351  -1.453846
3  4.700000   4.000000
4  5.600000  12.200000
5  6.800000  14.400000

In [230]:
# So interpolate has a number of methods that you can use to interpolate between the NaN’s. 
# The default, which is executed with no argument is linear and what it does is ignore the index and treats 
# the values as equally spaced and looks to linearly fill between the values. 
# The remaining methods are all taken from scipy interpolate with a brief description given below:

# ● barycentric: Constructs a polynomial that passes through a given set of points.
# ● pchip: PCHIP one-dimensional monotonic cubic interpolation
# ● akima: Fit piecewise cubic polynomials, given vectors x and y
# ● spline: Spline data interpolator where we can pass the order of the spline
# ● polynomial: Polynomial data interpolator where we can pass the order of the polynomial

# For more information please refer to the scipy documentation.
# Next, we will consider interpolate on a series and show some of the optional arguments that we can pass.

ser = pd.Series([np.nan, np.nan, 5, np.nan, np.nan, np.nan, 13, np.nan])
ser

0     NaN
1     NaN
2     5.0
3     NaN
4     NaN
5     NaN
6    13.0
7     NaN
dtype: float64

In [231]:
ser.interpolate()

0     NaN
1     NaN
2     5.0
3     7.0
4     9.0
5    11.0
6    13.0
7    13.0
dtype: float64

In [232]:
ser.interpolate(limit=1)

0     NaN
1     NaN
2     5.0
3     7.0
4     NaN
5     NaN
6    13.0
7    13.0
dtype: float64

In [233]:
ser.interpolate(limit=1, limit_direction="backward")

0     NaN
1     5.0
2     5.0
3     NaN
4     NaN
5    11.0
6    13.0
7     NaN
dtype: float64

In [234]:
ser.interpolate(limit=1, limit_direction="both")

0     NaN
1     5.0
2     5.0
3     7.0
4     NaN
5    11.0
6    13.0
7    13.0
dtype: float64

In [235]:
ser.interpolate(limit_direction="both")

0     5.0
1     5.0
2     5.0
3     7.0
4     9.0
5    11.0
6    13.0
7    13.0
dtype: float64

In [236]:
ser.interpolate(limit=1, limit_direction="both", limit_area="inside")

0     NaN
1     NaN
2     5.0
3     7.0
4     NaN
5    11.0
6    13.0
7     NaN
dtype: float64

In [237]:
ser.interpolate(limit_direction="backward", limit_area="outside")

0     5.0
1     5.0
2     5.0
3     NaN
4     NaN
5     NaN
6    13.0
7     NaN
dtype: float64

In [238]:
ser.interpolate(limit_direction="both", limit_area="outside")

0     5.0
1     5.0
2     5.0
3     NaN
4     NaN
5     NaN
6    13.0
7    13.0
dtype: float64

In [239]:
# Initially, we interpolate using the default method which is linear, and for the rest of the example we use the default method 
# and vary the optional arguments. 
# Next, we pass the limit option and set it to 1 which says we can only interpolate one past any value so we still have NaN data
# in the Series. 
# We next keep limit set to 1 and add another argument limit direction and set it to backward. 
# What this does is only interpolate one value next to an existing value but unlike before does it going backwards. 
# We extend this in the next example by setting the limit direction to be both which interpolates both forwards and backwards 
# for one value.
# We next remove the limit one and keep limit direction to be both and see that all values are interpolated. 
# We next introduce the limit area option which has two options (aside from the default None) these are inside and outside. 
# When set to inside NaN’s are only filled when they are surrounded by valid values and when set to outside it only fills 
# outside valid values.
# Here, we show examples using each of these alongside limit direction and limit.

In [240]:
# Next, we introduce the 'replace' method.

iris.sepal_length.unique()

array([5.1, 4.9, 4.7, 4.6, 5. , 5.4, 4.4, 4.8, 4.3, 5.8, 5.7, 5.2, 5.5,
       4.5, 5.3, 7. , 6.4, 6.9, 6.5, 6.3, 6.6, 5.9, 6. , 6.1, 5.6, 6.7,
       6.2, 6.8, 7.1, 7.6, 7.3, 7.2, 7.7, 7.4, 7.9])

In [241]:
iris.sepal_width.unique()

array([3.5, 3. , 3.2, 3.1, 3.6, 3.9, 3.4, 2.9, 3.7, 4. , 4.4, 3.8, 3.3,
       4.1, 4.2, 2.3, 2.8, 2.4, 2.7, 2. , 2.2, 2.5, 2.6])

In [242]:
iris.petal_length.unique()

array([1.4, 1.3, 1.5, 1.7, 1.6, 1.1, 1.2, 1. , 1.9, 4.7, 4.5, 4.9, 4. ,
       4.6, 3.3, 3.9, 3.5, 4.2, 3.6, 4.4, 4.1, 4.8, 4.3, 5. , 3.8, 3.7,
       5.1, 3. , 6. , 5.9, 5.6, 5.8, 6.6, 6.3, 6.1, 5.3, 5.5, 6.7, 6.9,
       5.7, 6.4, 5.4, 5.2])

In [243]:
iris.petal_width.unique()

array([0.2, 0.4, 0.3, 0.1, 0.5, 0.6, 1.4, 1.5, 1.3, 1.6, 1. , 1.1, 1.8,
       1.2, 1.7, 2.5, 1.9, 2.1, 2.2, 2. , 2.4, 2.3])

In [244]:
x = iris.replace(2.3, 2.35)

In [245]:
x.petal_width.unique()

array([0.2 , 0.4 , 0.3 , 0.1 , 0.5 , 0.6 , 1.4 , 1.5 , 1.3 , 1.6 , 1.  ,
       1.1 , 1.8 , 1.2 , 1.7 , 2.5 , 1.9 , 2.1 , 2.2 , 2.  , 2.4 , 2.35])

In [246]:
iris.species.unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [247]:
iris.replace(['setosa', 'versicolor', 'virginica'],
             ['set', 'ver', 'vir'])

     sepal_length  sepal_width  petal_length  petal_width species
0             5.1          3.5           1.4          0.2     set
1             4.9          3.0           1.4          0.2     set
2             4.7          3.2           1.3          0.2     set
3             4.6          3.1           1.5          0.2     set
4             5.0          3.6           1.4          0.2     set
..            ...          ...           ...          ...     ...
145           6.7          3.0           5.2          2.3     vir
146           6.3          2.5           5.0          1.9     vir
147           6.5          3.0           5.2          2.0     vir
148           6.2          3.4           5.4          2.3     vir
149           5.9          3.0           5.1          1.8     vir

[150 rows x 5 columns]

In [248]:
iris.replace(['setosa', 'versicolor', 'virginica'],
             ['set', 'ver', 'vir']).head(10)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2     set
1           4.9          3.0           1.4          0.2     set
2           4.7          3.2           1.3          0.2     set
3           4.6          3.1           1.5          0.2     set
4           5.0          3.6           1.4          0.2     set
5           5.4          3.9           1.7          0.4     set
6           4.6          3.4           1.4          0.3     set
7           5.0          3.4           1.5          0.2     set
8           4.4          2.9           1.4          0.2     set
9           4.9          3.1           1.5          0.1     set

In [249]:
iris.replace(['setosa', 'versicolor', 'virginica'],['set', 'ver', 'vir'])["species"].unique()

array(['set', 'ver', 'vir'], dtype=object)

In [250]:
# Grouping

# Next, we introduce the concept of grouping the data via the groupby method. 
# Grouping data is a very powerful tool as we are able to create and operate on groups of data all at once.

In [251]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [252]:
groupby = iris.groupby("species")

In [253]:
groupby

In [254]:
groupby.mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.428         1.462        0.246
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [255]:
groupby.median()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               5.0          3.4          1.50          0.2
versicolor           5.9          2.8          4.35          1.3
virginica            6.5          3.0          5.55          2.0

In [256]:
iris.groupby("species").max()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               5.8          4.4           1.9          0.6
versicolor           7.0          3.4           5.1          1.8
virginica            7.9          3.8           6.9          2.5

In [257]:
# Above we see the groupby applied to the iris dataset where we look to group the data based on the column species. 
# This then allows us to apply methods to the groupby object and we show the results of the sum and mean method applied to this. 
# What this is doing is applying this method to all the distinct types in species by all the columns in the dataset.

In [258]:
# We next demonstrate how to loop over a group. 
# Here, we set the DataFrame up as seen previously but now we loop over the group and in looping over it print the name of the
# group and what is in that group. 
# This gives us a good visualisation of what a groupby does to the data.

groupby = iris.groupby("species")
for name, group in groupby:
    print(name)
    print(group.head())

setosa
   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
versicolor
    sepal_length  sepal_width  petal_length  petal_width     species
50           7.0          3.2           4.7          1.4  versicolor
51           6.4          3.2           4.5          1.5  versicolor
52           6.9          3.1           4.9          1.5  versicolor
53           5.5          2.3           4.0          1.3  versicolor
54           6.5          2.8           4.6          1.5  versicolor
virginica
     sepal_length  sepal_width  petal_length  petal_width    species
100           6.3          3.3           6.0          2.5  virginica
101           5.8          2.7           5.1          1.9  virginica
102           7.1          3.0           5.9          2.1  virginica
103           6.3          2.9           5.6          1.8  virginica
104           6.5          3.0           5.8          2.2  virginica

In [259]:
# Next, we introduce the aggregate method applied to a groupby. 
# We set the data up in the same way as seen earlier and then apply the aggregate method of the groupby object and
# inside it pass what we want to use for this aggregation. 
# In the example, we show the np.mean method which will be applied to the group.

grouped = iris.groupby("species")
grouped.aggregate(np.mean)

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.428         1.462        0.246
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [260]:
# We can extend the previous example by introducing the as_index argument. 
# Here, we use the same DataFrame from the previous examples and groupby species with as_index set to False. 
# What this does is create a group on species but retain species in the output as its column with the value we want to group by. 
# In this case, we apply the mean to the group and so all other columns are summed within the group.

iris.groupby("species", as_index=False).mean()

      species  sepal_length  sepal_width  petal_length  petal_width
0      setosa         5.006        3.428         1.462        0.246
1  versicolor         5.936        2.770         4.260        1.326
2   virginica         6.588        2.974         5.552        2.026

In [261]:
iris.groupby("species", as_index=True).mean()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.428         1.462        0.246
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [262]:
# There are also methods that we can apply to a groupby object which can be useful.

grouped = iris.groupby("species")
grouped.size()

species
setosa        50
versicolor    50
virginica     50
dtype: int64

In [263]:
grouped["sepal_length"].describe()

            count   mean       std  min    25%  50%  75%  max
species
setosa       50.0  5.006  0.352490  4.3  4.800  5.0  5.2  5.8
versicolor   50.0  5.936  0.516171  4.9  5.600  5.9  6.3  7.0
virginica    50.0  6.588  0.635880  4.9  6.225  6.5  6.9  7.9

In [264]:
# We can also apply different methods to the group and in this example we show multiple ways to apply the numpy methods 
# sum, mean, and std to our grouped data. 
# So we create the same DataFrame and group as in the last examples. 
# What we can then do is use the agg method with the arguments being a list of methods to be applied and what we see is
# that each method is applied on the group of data. 
# Lastly, here we can even apply a lambda function to the groupby.

grouped = iris.groupby("species")
grouped["sepal_length"].aggregate([np.sum, np.mean, np.std])

              sum   mean       std
species
setosa      250.3  5.006  0.352490
versicolor  296.8  5.936  0.516171
virginica   329.4  6.588  0.635880

In [265]:
grouped.aggregate({lambda x: np.std(x, ddof=1)})

           sepal_length sepal_width petal_length petal_width
               <lambda>    <lambda>     <lambda>    <lambda>
species
setosa         0.352490    0.379064     0.173664    0.105386
versicolor     0.516171    0.313798     0.469911    0.197753
virginica      0.635880    0.322497     0.551895    0.274650

In [266]:
# What we next show is that you can get the largest and smallest values with a group by using 
# the 'nlargest' and 'nsmallest' methods. 
# Here, the integer value you pass in gives you the number of values returned. 
# What you see is that we get the largest and smallest per group.

grouped = iris.groupby("species")
grouped["sepal_length"].nlargest(3)

species
setosa      14     5.8
            15     5.7
            18     5.7
versicolor  50     7.0
            52     6.9
            76     6.8
virginica   131    7.9
            117    7.7
            118    7.7
Name: sepal_length, dtype: float64

In [267]:
grouped["petal_length"].nsmallest(4)

species
setosa      22     1.0
            13     1.1
            14     1.2
            35     1.2
versicolor  98     3.0
            57     3.3
            93     3.3
            60     3.5
virginica   106    4.5
            126    4.8
            138    4.8
            121    4.9
Name: petal_length, dtype: float64

In [268]:
# Our next example introduces the apply method which can be very useful. 
# Here, we set the data up in the manner seen before and groupby column species. 
# We can then use the apply method on the group to apply whatever we pass through it to the groupby. 
# It should be noted we can also use the apply method on DataFrames and Series. 
# Here we see we have applied a custom function to the groupby.

grouped = iris.groupby("species")
def f(group):
    return pd.DataFrame({"original": group, "demeaned": group - group.mean()})

In [269]:
grouped["petal_length"].mean()

species
setosa        1.462
versicolor    4.260
virginica     5.552
Name: petal_length, dtype: float64

In [270]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [271]:
grouped["petal_length"].apply(f).head()

   original  demeaned
0       1.4    -0.062
1       1.4    -0.062
2       1.3    -0.162
3       1.5     0.038
4       1.4    -0.062

In [272]:
# In the next example, we introduce a nice pandas method called qcut. 
# This cuts the data into equal sized buckets based on the arguments passed in. 
# Here, we apply the qcut on the data which is the column sepal length of the iris dataset by the list of 
# values 0, 0.25, 0.5, 0.75, and 1. 
# We assign the cut to the variable factor and when passed into the groupby the mean method gives the average 
# on each bucket showing what the min and max values in the buckets are.

factor = pd.qcut(iris["sepal_length"], [0, 0.25, 0.5, 0.75, 1])
factor.head()

0    (4.2989999999999995, 5.1]
1    (4.2989999999999995, 5.1]
2    (4.2989999999999995, 5.1]
3    (4.2989999999999995, 5.1]
4    (4.2989999999999995, 5.1]
Name: sepal_length, dtype: category
Categories (4, interval[float64]): [(4.2989999999999995, 5.1] < (5.1, 5.8] < (5.8, 6.4] < (6.4, 7.9]]

In [273]:
iris.groupby(factor).mean()

,sepal_length,sepal_width,petal_length,petal_width
sepal_length,,,,
"(4.2989999999999995, 5.1]",4.856098,3.175610,1.707317,0.353659
"(5.1, 5.8]",5.558974,3.089744,3.256410,0.989744
"(5.8, 6.4]",6.188571,2.868571,4.908571,1.682857
"(6.4, 7.9]",6.971429,3.071429,5.568571,1.940000

In [274]:
# So far we have considered grouping on single columns. 
# However, we could also group on multiple columns. 
# However, the iris dataset isn’t best setup to allow us to do this so we instead load the tips dataset. 
# The tips dataset contains the following columns:

# ● total_bill
# ● tip
# ● sex
# ● smoker
# ● day
# ● time
# ● size

# Given some of the columns only have limited responses, it makes it ideal to do a group by multiple columns. 
# So next we group by sex and smoker.

tips = sns.load_dataset("tips")
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [275]:
tips.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [276]:
grouped = tips.groupby(["sex","smoker"])
grouped

In [277]:
grouped.mean()

               total_bill       tip      size
sex    smoker
Male   Yes      22.284500  3.051167  2.500000
       No       19.791237  3.113402  2.711340
Female Yes      17.977879  2.931515  2.242424
       No       18.105185  2.773519  2.592593

In [278]:
grouped.sum()

               total_bill     tip  size
sex    smoker
Male   Yes        1337.07  183.07   150
       No         1919.75  302.00   263
Female Yes         593.27   96.74    74
       No          977.68  149.77   140

In [279]:
grouped = tips.groupby(["sex","smoker","time"])
grouped.mean()

                      total_bill       tip      size
sex    smoker time
Male   Yes    Lunch    17.374615  2.790769  2.153846
              Dinner   23.642553  3.123191  2.595745
       No     Lunch    18.486500  2.941500  2.500000
              Dinner   20.130130  3.158052  2.766234
Female Yes    Lunch    17.431000  2.891000  2.300000
              Dinner   18.215652  2.949130  2.217391
       No     Lunch    15.902400  2.459600  2.520000
              Dinner   20.004138  3.044138  2.655172

In [280]:
# Here, we see that when we group by two or three variables we increase the number of values that are returned 
# by creating more combinations within the groups.
# A similar approach to groupby is pivot table which is a common amongst spreadsheet users. 
# The concept is to take a combination of variables and group the data by it, which can seem similar to groupby. 
# The difference is you can extend upon this to create some more complicated groupings of your dataset. 
# We will demonstrate these by example.

tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [281]:
pd.pivot_table(tips, index=["sex"])

            size       tip  total_bill
sex
Male    2.630573  3.089618   20.744076
Female  2.459770  2.833448   18.056897

In [282]:
pd.pivot_table(tips, index=["sex","smoker","day"])

                        size       tip  total_bill
sex    smoker day
Male   Yes    Thur  2.300000  3.058000   19.171000
              Fri   2.125000  2.741250   20.452500
              Sat   2.629630  2.879259   21.837778
              Sun   2.600000  3.521333   26.141333
       No     Thur  2.500000  2.941500   18.486500
              Fri   2.000000  2.500000   17.475000
              Sat   2.656250  3.256563   19.929063
              Sun   2.883721  3.115349   20.403256
Female Yes    Thur  2.428571  2.990000   19.218571
              Fri   2.000000  2.682857   12.654286
              Sat   2.200000  2.868667   20.266667
              Sun   2.500000  3.500000   16.540000
       No     Thur  2.480000  2.459600   16.014400
              Fri   2.500000  3.125000   19.365000
              Sat   2.307692  2.724615   19.003846
              Sun   3.071429  3.329286   20.824286

In [283]:
pd.pivot_table(tips, index=["sex","smoker","day"], values=["tip"])

                         tip
sex    smoker day
Male   Yes    Thur  3.058000
              Fri   2.741250
              Sat   2.879259
              Sun   3.521333
       No     Thur  2.941500
              Fri   2.500000
              Sat   3.256563
              Sun   3.115349
Female Yes    Thur  2.990000
              Fri   2.682857
              Sat   2.868667
              Sun   3.500000
       No     Thur  2.459600
              Fri   3.125000
              Sat   2.724615
              Sun   3.329286

In [284]:
# In the above code, we use the tips as the dataset in each example and set a variety of index values starting 
# at just sex and extending to sex and smoker and then with the combination of sex, smoker and day. 
# In each example, when we pivot the data by default we end up with the average of the index across all of the 
# variables where we can take an average, so only numerical variables. 
# We don’t necessarily need to show all available variables as we have seen by passing the values argument as 
# a list of columns we want to include.

# As a default, when we use the pivot table command we get the average of the variables.
# However, we can control what we get back by passing the aggfunc argument which takes a list of 
# functions we want to apply to the data. 
# Note here that we pass the numpy mean function as well as the len from the standard Python library.

pd.pivot_table(tips, index=["sex","smoker","day"], values=["tip"], aggfunc=[np.mean,len])

                        mean   len
                         tip   tip
sex    smoker day
Male   Yes    Thur  3.058000  10.0
              Fri   2.741250   8.0
              Sat   2.879259  27.0
              Sun   3.521333  15.0
       No     Thur  2.941500  20.0
              Fri   2.500000   2.0
              Sat   3.256563  32.0
              Sun   3.115349  43.0
Female Yes    Thur  2.990000   7.0
              Fri   2.682857   7.0
              Sat   2.868667  15.0
              Sun   3.500000   4.0
       No     Thur  2.459600  25.0
              Fri   3.125000   2.0
              Sat   2.724615  13.0
              Sun   3.329286  14.0

In [285]:
# We can expand on this example by adding in the margins variable which then gives us the totals 
# associated with the rows and columns.

pd.pivot_table(tips, index=["sex","smoker"], values=["tip"], columns=["day"], aggfunc=[np.mean])

                 mean
                  tip
day              Thur       Fri       Sat       Sun
sex    smoker
Male   Yes     3.0580  2.741250  2.879259  3.521333
       No      2.9415  2.500000  3.256563  3.115349
Female Yes     2.9900  2.682857  2.868667  3.500000
       No      2.4596  3.125000  2.724615  3.329286

In [286]:
pd.pivot_table(tips, index=["sex","smoker"], columns=["day"], values=["tip"], aggfunc=[np.mean], margins=True)

                   mean
                    tip
day                Thur       Fri       Sat       Sun       All
sex    smoker
Male   Yes     3.058000  2.741250  2.879259  3.521333  3.051167
       No      2.941500  2.500000  3.256563  3.115349  3.113402
Female Yes     2.990000  2.682857  2.868667  3.500000  2.931515
       No      2.459600  3.125000  2.724615  3.329286  2.773519
All            2.771452  2.734737  2.993103  3.255132  2.998279

In [287]:
# Reading in Files with Pandas

# The examples in the chapter have used the datasets from Seaborn and while this is useful, pandas has a lot of methods 
# to allow you to read in external files. 
# If we relate this back to earlier in the book where we read and manipulated data within Python we can see that these 
# methods are a lot easier to use. 
# They also allow us to write back to file. 
# To show how this works we will take one of the existing datasets that we have been using and write to a csv and read 
# that back in:

tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [288]:
import os
x = os.getcwd()
x

'C:\\Users\\HAFIFI\\Documents\\Python Jupyter Notebook\\The Python Book'

In [289]:
file_name = "\\Files\\tips.csv"
file_path = x + file_name

In [290]:
tips.to_csv(file_path, index=False)

In [291]:
data = pd.read_csv(file_path)

In [292]:
data.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [293]:
# What we have done is use the 'to_csv' method that the tips DataFrame has and write the data into a file called ‘tips.csv’.
# Note this will live in the directory where this is being run from or set for (like in above example), as well as the 
# file name the index argument is set to False which prevents the DataFrame index being written to the file with the 
# other columns. 
# Now, to read this back in, we use the read_csv method from pandas and this takes the csv file and creates a DataFrame
# with the contents of this file. 
# These methods are extremely useful as we do not have to worry about the process of writing to file or reading from file. 
# Alongside 'read_csv' method, we have other read methods for different file types and here are some of the more useful ones. 
# For a complete list, consult the pandas documentation.

# ● read_excel: reads in xls, xlsx, xlsm, xlsb, odf, ods and odt file types
# ● read_json: reads a valid json string

In [294]:
# If we take the examples in previous chapters, we created the following json and excel files called 
# boston.json and boston.xlsx. 
# We can read these into DataFrames using the following code:

file_name = "\\Files\\boston.json"
file_path = x + file_name

data = pd.read_json(file_path)
data

      CRIM   NOX
0  0.00632  2.31
1  0.02731  7.07
2  0.02729  7.07
3  0.03237  2.18
4  0.06905  2.18

In [295]:
file_name = "\\Files\\boston.xlsx"
file_path = x + file_name

data = pd.read_excel(file_path)
data

      CRIM   NOX
0  0.00632  2.31
1  0.02731  7.07
2  0.02729  7.07
3  0.03237  2.18
4  0.06905  2.18

In [296]:
# As you can see these methods provide very simple ways to load data from these common formats into DataFrames. 
# There is also a read_table method which we can use for general delimited files. 
# The 'read' methods also support operations like querying databases or even reading html but that is beyond the 
# scope of this book but well worth a look.
# The to methods of the DataFrames are pretty similar with support for many different formats and a selection given as follows:

# ● to_dict
# ● to_json
# ● to_html
# ● to_latex
# ● to_string

# These are all demonstrated as follows:

tips = sns.load_dataset("tips")
tips.head().to_json()

'{"total_bill":{"0":16.99,"1":10.34,"2":21.01,"3":23.68,"4":24.59},"tip":{"0":1.01,"1":1.66,"2":3.5,"3":3.31,"4":3.61},"sex":{"0":"Female","1":"Male","2":"Male","3":"Male","4":"Female"},"smoker":{"0":"No","1":"No","2":"No","3":"No","4":"No"},"day":{"0":"Sun","1":"Sun","2":"Sun","3":"Sun","4":"Sun"},"time":{"0":"Dinner","1":"Dinner","2":"Dinner","3":"Dinner","4":"Dinner"},"size":{"0":2,"1":3,"2":3,"3":2,"4":4}}'

In [297]:
# We can also use some of these methods to write the data directly to file in the format with some examples below:

file_name = "\\Files\\tips.json"
file_path = x + file_name

tips.to_json(file_path)

In [298]:
tips.head().to_dict()

{'total_bill': {0: 16.99, 1: 10.34, 2: 21.01, 3: 23.68, 4: 24.59},
 'tip': {0: 1.01, 1: 1.66, 2: 3.5, 3: 3.31, 4: 3.61},
 'sex': {0: 'Female', 1: 'Male', 2: 'Male', 3: 'Male', 4: 'Female'},
 'smoker': {0: 'No', 1: 'No', 2: 'No', 3: 'No', 4: 'No'},
 'day': {0: 'Sun', 1: 'Sun', 2: 'Sun', 3: 'Sun', 4: 'Sun'},
 'time': {0: 'Dinner', 1: 'Dinner', 2: 'Dinner', 3: 'Dinner', 4: 'Dinner'},
 'size': {0: 2, 1: 3, 2: 3, 3: 2, 4: 4}}

In [299]:
tips.head().to_html()

'<table border="1" class="dataframe">\n  <thead>\n    <tr style="text-align: right;">\n      <th></th>\n      <th>total_bill</th>\n      <th>tip</th>\n      <th>sex</th>\n      <th>smoker</th>\n      <th>day</th>\n      <th>time</th>\n      <th>size</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>16.99</td>\n      <td>1.01</td>\n      <td>Female</td>\n      <td>No</td>\n      <td>Sun</td>\n      <td>Dinner</td>\n      <td>2</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>10.34</td>\n      <td>1.66</td>\n      <td>Male</td>\n      <td>No</td>\n      <td>Sun</td>\n      <td>Dinner</td>\n      <td>3</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>21.01</td>\n      <td>3.50</td>\n      <td>Male</td>\n      <td>No</td>\n      <td>Sun</td>\n      <td>Dinner</td>\n      <td>3</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>23.68</td>\n      <td>3.31</td>\n      <td>Male</td>\n      <td>No</td>\n      <td>Sun</td>\n      <td>Dinner</td>\n      <td>2</td>\n    </tr>\n    <tr>\n      <th>4</th>\n      <td>24.59</td>\n      <td>3.61</td>\n      <td>Female</td>\n      <td>No</td>\n      <td>Sun</td>\n      <td>Dinner</td>\n      <td>4</td>\n    </tr>\n  </tbody>\n</table>'

In [300]:
file_name = "\\Files\\tips.html"
file_path = x + file_name

tips.to_html(file_path)

In [301]:
tips.head().to_latex()

'\\begin{tabular}{lrrllllr}\n\\toprule\n{} &  total\\_bill &   tip &     sex & smoker &  day &    time &  size \\\\\n\\midrule\n0 &       16.99 &  1.01 &  Female &     No &  Sun &  Dinner &     2 \\\\\n1 &       10.34 &  1.66 &    Male &     No &  Sun &  Dinner &     3 \\\\\n2 &       21.01 &  3.50 &    Male &     No &  Sun &  Dinner &     3 \\\\\n3 &       23.68 &  3.31 &    Male &     No &  Sun &  Dinner &     2 \\\\\n4 &       24.59 &  3.61 &  Female &     No &  Sun &  Dinner &     4 \\\\\n\\bottomrule\n\\end{tabular}\n'

In [302]:
file_name = "\\Files\\tips.latex"
file_path = x + file_name

tips.to_latex(file_path)

In [303]:
file_name = "\\Files\\tips.tex"
file_path = x + file_name

tips.to_latex(file_path)

In [304]:
tips.head().to_string()

'   total_bill   tip     sex smoker  day    time  size\n0       16.99  1.01  Female     No  Sun  Dinner     2\n1       10.34  1.66    Male     No  Sun  Dinner     3\n2       21.01  3.50    Male     No  Sun  Dinner     3\n3       23.68  3.31    Male     No  Sun  Dinner     2\n4       24.59  3.61  Female     No  Sun  Dinner     4'

In [305]:
file_name = "\\Files\\tips.txt"
file_path = x + file_name

tips.to_string(file_path)

In [306]:
# These methods are really useful and for correctly formatted data are a very convenient way to read data into pandas 
# and also export it from pandas.
# What we have seen in this chapter is the advanced methods of pandas and how we can do complex data analysis. 
# We have shown how pandas allows us to manipulate data as if it were in a database allows us to join, merge, group, and pivot
# the data in a variety of ways.
# We have also covered some of the built in methods that pandas has and shown how we can deal with missing data. 
# The examples that we have covered have been rather simple in nature but pandas is powerful enough to deal with large datasets
# and that makes it an extremely powerful Python package. 
# It is also worth noting that pandas plays well with many other Python packages meaning a mastery of it is essential for a 
# Python programmer.